python/07.function.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-02-09 Sat 21:46 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>函数</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jinghui Hu" />
</head>
<body>
<div id="content">
<h1 class="title">函数</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc82bd13">1. 函数定义</a></li>
<li><a href="#org985614b">2. 函数传参</a>
<ul>
<li><a href="#org2a84adf">2.1. 默认参数</a></li>
<li><a href="#orgcaef115">2.2. 变长参数</a></li>
<li><a href="#org02b9b21">2.3. lambda 表达式</a></li>
<li><a href="#orgc8f8e39">2.4. 装饰器</a></li>
</ul>
</li>
<li><a href="#org9d22518">3. 匿名函数</a></li>
<li><a href="#orgde00982">4. 全局变量</a></li>
<li><a href="#org39ba147">5. 参考链接</a></li>
</ul>
</div>
</div>


<div id="outline-container-orgc82bd13" class="outline-2">
<h2 id="orgc82bd13"><span class="section-number-2">1</span> 函数定义</h2>
<div class="outline-text-2" id="text-1">
<p>
函数通过 def 关键字来定义，定义的例子如下：
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #859900;">def</span> <span style="color: #b58900;">myfunc</span><span style="color: #8d5649;">(</span>arg<span style="color: #8d5649;">)</span>:
  <span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>arg<span style="color: #8d5649;">)</span>

<span style="color: #859900;">def</span> <span style="color: #b58900;">fib_lessthan</span><span style="color: #8d5649;">(</span>n<span style="color: #8d5649;">)</span>:
  <span style="color: #6c71c4;">ans</span> = <span style="color: #8d5649;">[]</span>
  <span style="color: #6c71c4;">a</span>, <span style="color: #6c71c4;">b</span> = 0, 1
  <span style="color: #859900;">while</span> a &lt; n:
    ans.append<span style="color: #8d5649;">(</span>a<span style="color: #8d5649;">)</span>
    <span style="color: #6c71c4;">a</span>, <span style="color: #6c71c4;">b</span> = b, a+b
  <span style="color: #859900;">return</span> ans

<span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>fib_lessthan<span style="color: #d8241f;">(</span>10<span style="color: #d8241f;">)</span><span style="color: #8d5649;">)</span>
</pre>
</div>

<pre class="example">
[0, 1, 1, 2, 3, 5, 8]

</pre>
</div>
</div>


<div id="outline-container-org985614b" class="outline-2">
<h2 id="org985614b"><span class="section-number-2">2</span> 函数传参</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org2a84adf" class="outline-3">
<h3 id="org2a84adf"><span class="section-number-3">2.1</span> 默认参数</h3>
<div class="outline-text-3" id="text-2-1">
<p>
在函数最后使用 <code>=</code> 可以给参数添加默认的值。
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #859900;">def</span> <span style="color: #b58900;">increase</span><span style="color: #8d5649;">(</span>n, step=1<span style="color: #8d5649;">)</span>:
  <span style="color: #859900;">return</span> n + step

<span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>increase<span style="color: #d8241f;">(</span>2<span style="color: #d8241f;">)</span><span style="color: #8d5649;">)</span>
<span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>increase<span style="color: #d8241f;">(</span>1, 5<span style="color: #d8241f;">)</span><span style="color: #8d5649;">)</span>
<span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>increase<span style="color: #d8241f;">(</span>1, step=10<span style="color: #d8241f;">)</span><span style="color: #8d5649;">)</span>
</pre>
</div>

<pre class="example">
3
6
11

</pre>

<p>
需要注意的是： <b>函数的默认参数只初始化一次</b> 。例如，下面例子中的 <code>L</code> 默认只在开
始第一次初始化，后面每次调用都是添加到第一次初始化的列表中。
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #859900;">def</span> <span style="color: #b58900;">f</span><span style="color: #8d5649;">(</span>a, L=<span style="color: #d8241f;">[]</span><span style="color: #8d5649;">)</span>:
  L.append<span style="color: #8d5649;">(</span>a<span style="color: #8d5649;">)</span>
  <span style="color: #859900;">return</span> L

<span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>f<span style="color: #d8241f;">(</span>1<span style="color: #d8241f;">)</span><span style="color: #8d5649;">)</span>
<span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>f<span style="color: #d8241f;">(</span>2<span style="color: #d8241f;">)</span><span style="color: #8d5649;">)</span>
<span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>f<span style="color: #d8241f;">(</span>3<span style="color: #d8241f;">)</span><span style="color: #8d5649;">)</span>
</pre>
</div>

<pre class="example">
[1]
[1, 2]
[1, 2, 3]

</pre>
</div>
</div>

<div id="outline-container-orgcaef115" class="outline-3">
<h3 id="orgcaef115"><span class="section-number-3">2.2</span> 变长参数</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Python 的边长参数传递可以通过列表或者字典实现。当在参数前面添加一个 <code>*</code> 表示在当
前参数列表中的变长部分都会放入一个列表中传进函数里面， <code>**</code> 会放入一个字典中。
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">parameter with single star</span>
<span style="color: #859900;">def</span> <span style="color: #b58900;">print_param</span><span style="color: #8d5649;">(</span>*params<span style="color: #8d5649;">)</span>:
    <span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>params<span style="color: #8d5649;">)</span>

print_param<span style="color: #8d5649;">(</span><span style="color: #2aa198;">'aa'</span><span style="color: #8d5649;">)</span>
print_param<span style="color: #8d5649;">(</span><span style="color: #2aa198;">'aa'</span>, <span style="color: #2aa198;">'bb'</span><span style="color: #8d5649;">)</span>

<span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">parameter with double star</span>
<span style="color: #859900;">def</span> <span style="color: #b58900;">print_param2</span><span style="color: #8d5649;">(</span>**params<span style="color: #8d5649;">)</span>:
    <span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>params<span style="color: #8d5649;">)</span>
print_param2<span style="color: #8d5649;">(</span>x=1, y=2<span style="color: #8d5649;">)</span>

<span style="color: #859900;">def</span> <span style="color: #b58900;">print_param3</span><span style="color: #8d5649;">(</span>x, y, *args, **kargs<span style="color: #8d5649;">)</span>:
    <span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>x, y<span style="color: #8d5649;">)</span>
    <span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>args<span style="color: #8d5649;">)</span>
    <span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>kargs<span style="color: #8d5649;">)</span>
print_param3<span style="color: #8d5649;">(</span>1, 2, 3, 4, 5, p=<span style="color: #2aa198;">'3'</span>, k=<span style="color: #2aa198;">'d'</span><span style="color: #8d5649;">)</span>
</pre>
</div>

<pre class="example">
('aa',)
('aa', 'bb')
{'x': 1, 'y': 2}
1 2
(3, 4, 5)
{'p': '3', 'k': 'd'}

</pre>

<p>
<code>*</code> 和 <code>**</code> 除了定义变长参数的作用以外，还可以用于将列表和字典参数解包，下面是一
个使用的例子。
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #6c71c4;">list</span><span style="color: #8d5649;">(</span><span style="color: #6c71c4;">range</span><span style="color: #d8241f;">(</span>3, 6<span style="color: #d8241f;">)</span><span style="color: #8d5649;">)</span>            <span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">normal call with separate arguments</span>
<span style="color: #6c71c4;">args</span> = <span style="color: #8d5649;">[</span>3, 6<span style="color: #8d5649;">]</span>
<span style="color: #6c71c4;">list</span><span style="color: #8d5649;">(</span><span style="color: #6c71c4;">range</span><span style="color: #d8241f;">(</span>*args<span style="color: #d8241f;">)</span><span style="color: #8d5649;">)</span>            <span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">call with arguments unpacked from a list</span>

<span style="color: #859900;">def</span> <span style="color: #b58900;">parrot</span><span style="color: #8d5649;">(</span>voltage, state=<span style="color: #2aa198;">'a stiff'</span>, action=<span style="color: #2aa198;">'voom'</span><span style="color: #8d5649;">)</span>:
  <span style="color: #859900;">print</span><span style="color: #8d5649;">(</span><span style="color: #2aa198;">"-- This parrot wouldn't"</span>, action, end=<span style="color: #2aa198;">' '</span><span style="color: #8d5649;">)</span>
  <span style="color: #859900;">print</span><span style="color: #8d5649;">(</span><span style="color: #2aa198;">"if you put"</span>, voltage, <span style="color: #2aa198;">"volts through it."</span>, end=<span style="color: #2aa198;">' '</span><span style="color: #8d5649;">)</span>
  <span style="color: #859900;">print</span><span style="color: #8d5649;">(</span><span style="color: #2aa198;">"E's"</span>, state, <span style="color: #2aa198;">"!"</span><span style="color: #8d5649;">)</span>
<span style="color: #6c71c4;">d</span> = <span style="color: #8d5649;">{</span><span style="color: #2aa198;">"voltage"</span>: <span style="color: #2aa198;">"four million"</span>, <span style="color: #2aa198;">"state"</span>: <span style="color: #2aa198;">"bleedin' demised"</span>, <span style="color: #2aa198;">"action"</span>: <span style="color: #2aa198;">"VOOM"</span><span style="color: #8d5649;">}</span>
parrot<span style="color: #8d5649;">(</span>**d<span style="color: #8d5649;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org02b9b21" class="outline-3">
<h3 id="org02b9b21"><span class="section-number-3">2.3</span> lambda 表达式</h3>
<div class="outline-text-3" id="text-2-3">
<p>
lambda 表达式其实是匿名函数，lambda 表达式可以帮助我们来实现闭包操作。如下定义了
<code>make_incrementor</code> 来动态生成 <code>add5</code> 和 <code>add10</code> 函数。
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #859900;">def</span> <span style="color: #b58900;">make_incrementor</span><span style="color: #8d5649;">(</span>n<span style="color: #8d5649;">)</span>:
  <span style="color: #859900;">return</span> <span style="color: #859900;">lambda</span> x: x + n

<span style="color: #6c71c4;">add5</span> = make_incrementor<span style="color: #8d5649;">(</span>5<span style="color: #8d5649;">)</span>
<span style="color: #6c71c4;">add10</span> = make_incrementor<span style="color: #8d5649;">(</span>10<span style="color: #8d5649;">)</span>

<span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>add5<span style="color: #d8241f;">(</span>4<span style="color: #d8241f;">)</span><span style="color: #8d5649;">)</span>
<span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>add10<span style="color: #d8241f;">(</span>4<span style="color: #d8241f;">)</span><span style="color: #8d5649;">)</span>
</pre>
</div>

<pre class="example">
9
14

</pre>
</div>
</div>

<div id="outline-container-orgc8f8e39" class="outline-3">
<h3 id="orgc8f8e39"><span class="section-number-3">2.4</span> 装饰器</h3>
<div class="outline-text-3" id="text-2-4">
<p>
装饰器是一个返回函数的高阶函数，通常是对一个函数进行一些属性设置后再将结果返回给
原来的函数。装饰器使用 <code>@</code> 修饰到函数定义的前面，下面是一个样例。
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #859900;">def</span> <span style="color: #b58900;">foo</span><span style="color: #8d5649;">()</span>:
    <span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">do something</span>

<span style="color: #859900;">def</span> <span style="color: #b58900;">decorator</span><span style="color: #8d5649;">(</span>func<span style="color: #8d5649;">)</span>:
    <span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">manipulate func</span>
    <span style="color: #859900;">return</span> func

<span style="color: #6c71c4;">foo</span> = decorator<span style="color: #8d5649;">(</span>foo<span style="color: #8d5649;">)</span>  <span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">Manually decorate</span>

<span style="color: #268bd2;">@decorator</span>
<span style="color: #859900;">def</span> <span style="color: #b58900;">bar</span><span style="color: #8d5649;">()</span>:
    <span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">Do something</span>
<span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">bar() is decorated</span>
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-org9d22518" class="outline-2">
<h2 id="org9d22518"><span class="section-number-2">3</span> 匿名函数</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li><code>filter(func,iter)</code> 只能处理一个参数 iter ，仅仅将满足 func 方法的数值过滤出来。</li>
<li><code>map(func,iter1,iter2,..)</code> 可以处理多个 iter，实现通过 func 方法对 iter1,
iter2,&#x2026; 进行处理。</li>
<li><code>reduce(func,iter,init)</code> 仅能处理一个 iter, init 为初始化值，执行顺序为：先将
每个 iter 内部第一个值和 init 进行 func 处理，处理的结果再与 iter 第二个值进
行 func 处理，直到结束。</li>
</ol>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #6c71c4;">numseq</span> = <span style="color: #6c71c4;">map</span><span style="color: #8d5649;">(</span><span style="color: #6c71c4;">str</span>, <span style="color: #6c71c4;">range</span><span style="color: #d8241f;">(</span>10<span style="color: #d8241f;">)</span><span style="color: #8d5649;">)</span>
<span style="color: #859900;">print</span><span style="color: #8d5649;">(</span><span style="color: #6c71c4;">list</span><span style="color: #d8241f;">(</span>numseq<span style="color: #d8241f;">)</span><span style="color: #8d5649;">)</span>
<span style="color: #6c71c4;">filnum</span> = <span style="color: #6c71c4;">filter</span><span style="color: #8d5649;">(</span><span style="color: #859900;">lambda</span> x: x &gt; 5, <span style="color: #6c71c4;">range</span><span style="color: #d8241f;">(</span>10<span style="color: #d8241f;">)</span><span style="color: #8d5649;">)</span>
<span style="color: #859900;">print</span><span style="color: #8d5649;">(</span><span style="color: #6c71c4;">list</span><span style="color: #d8241f;">(</span>filnum<span style="color: #d8241f;">)</span><span style="color: #8d5649;">)</span>
<span style="color: #859900;">from</span> functools <span style="color: #859900;">import</span> <span style="color: #6c71c4;">reduce</span>
<span style="color: #6c71c4;">ans</span> = <span style="color: #6c71c4;">reduce</span><span style="color: #8d5649;">(</span><span style="color: #859900;">lambda</span> x, y: x+y, <span style="color: #6c71c4;">range</span><span style="color: #d8241f;">(</span>100<span style="color: #d8241f;">)</span>, 0<span style="color: #8d5649;">)</span>
<span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>ans<span style="color: #8d5649;">)</span>
</pre>
</div>

<pre class="example">
['0', '1', '2', '3', '4', '5', '6', '7', '8', '9']
[6, 7, 8, 9]
4950

</pre>
</div>
</div>


<div id="outline-container-orgde00982" class="outline-2">
<h2 id="orgde00982"><span class="section-number-2">4</span> 全局变量</h2>
<div class="outline-text-2" id="text-4">
<p>
Python 定义的变量默认都是局部变量，如果需要定义全局变量需要使用 <code>global</code> 关键字
修饰。
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #6c71c4;">g_x</span> = 0
<span style="color: #859900;">def</span> <span style="color: #b58900;">change_x</span><span style="color: #8d5649;">()</span>:
    <span style="color: #859900;">global</span> g_x
    <span style="color: #6c71c4;">g_x</span> += 1

<span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>g_x<span style="color: #8d5649;">)</span>
change_x<span style="color: #8d5649;">()</span>
<span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>g_x<span style="color: #8d5649;">)</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-org39ba147" class="outline-2">
<h2 id="org39ba147"><span class="section-number-2">5</span> 参考链接</h2>
<div class="outline-text-2" id="text-5">
<ol class="org-ol">
<li><a href="https://docs.python.org/3/tutorial/controlflow.html#more-on-defining-functions">More on defining funciton</a></li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2018-10-23 Tue 00:00</p>
<p class="author">Author: Jinghui Hu</p>
<p class="date">Created: 2019-02-09 Sat 21:46</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
